In [1]:
import arrow
import pandas as pd
from datetime import datetime
import numpy as np

def convert_todate(df, column_name):
    data_series = []
    len_data = len(df[column_name])
    for idx in range(len_data):
        data = df[column_name].iloc[idx]
        try:
            at = arrow.get(data)
            date = at.date()
            data = date
        except: # jika NAN or NAT
            data = "0000-00-00"

        data_series.append(data)

    df[column_name] = data_series
    return df

In [2]:
df = pd.read_csv("../data/ASET_JALAN_JEMBATAN.csv", sep='|', encoding='ISO-8859-1')

In [3]:
df.head()

,KODE_KL,NAMA_KL,KODE_KPKNL,NAMA_KPKNL,KODE_SATKER,NAMA_SATKER,KODE_SUB_SATKER,NAMA_SUB_SATKER,KELOMPOK,SUB_KELOMPOK,...,UR_SATKER_PENGGUNA,ALAMAT_SATKER_PENGGUNA,KD_BRG_TANAH,UR_BRG_TANAH,NUP_TANAH,KD_SATKER_TANAH,NM_SATKER_TANAH,STATUS_SBSN,STATUS_IDLE,TGL_TARIK
0,60,KEPOLISIAN NEGARA RI,8101,KPKNL BANDUNG,060010200642775000KD,SATBRIMOB POLDA JABAR,060010200642775000KD,SATBRIMOB POLDA JABAR,JALAN,JALAN KHUSUS,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200226
1,60,KEPOLISIAN NEGARA RI,8101,KPKNL BANDUNG,060010200643035000KD,POLRES SUMEDANG,060010200643035000KD,POLRES SUMEDANG,JALAN,JALAN KHUSUS,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200226
2,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060010300643496000KD,POLRES PATI,060010300643496000KD,POLRES PATI,JALAN,JALAN KHUSUS,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200226
3,60,KEPOLISIAN NEGARA RI,9102,KPKNL SURAKARTA,060010300643571000KD,KEPOLISIAN RESOR BOYOLALI,060010300643571000KD,KEPOLISIAN RESOR BOYOLALI,JALAN,JALAN KHUSUS,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200226
4,60,KEPOLISIAN NEGARA RI,9110,KPKNL PURWOKERTO,060010300643649000KD,POLRES KEBUMEN,060010300643649000KD,POLRES KEBUMEN,JALAN,JALAN KHUSUS,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200226

In [4]:
df.columns

Index(['KODE_KL', 'NAMA_KL', 'KODE_KPKNL', 'NAMA_KPKNL', 'KODE_SATKER',
       'NAMA_SATKER', 'KODE_SUB_SATKER', 'NAMA_SUB_SATKER', 'KELOMPOK',
       'SUB_KELOMPOK', 'KODE_BARANG', 'NAMA_BARANG', 'NUP', 'NO_KIB',
       'TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA',
       'NILAI_PEROLEHAN_PERTAMA', 'NILAI_MUTASI', 'NILAI_PEROLEHAN',
       'NILAI_PENYUSUTAN', 'NILAI_BUKU', 'KONDISI', 'MERK', 'KUANTITAS',
       'NO_DANA', 'TGL_DANA', 'DARI', 'ASL_PERLH', 'TGL_PERLH', 'JUMLAH_FOTO',
       'LUAS_DASAR', 'LUAS_BANGUNAN', 'PANJANG', 'LEBAR', 'NO_PSP', 'TGL_PSP',
       'STATUS_PENGELOLAAN', 'STATUS_PENGGUNAAN', 'JENIS_PENGGUNA',
       'KD_SATKER_PENGGUNA', 'UR_SATKER_PENGGUNA', 'ALAMAT_SATKER_PENGGUNA',
       'KD_BRG_TANAH', 'UR_BRG_TANAH', 'NUP_TANAH', 'KD_SATKER_TANAH',
       'NM_SATKER_TANAH', 'STATUS_SBSN', 'STATUS_IDLE', 'TGL_TARIK'],
      dtype='object')

In [5]:
cname = ['TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA', 'TGL_DANA',  'TGL_PERLH',  'TGL_PSP',
         'TGL_TARIK']

In [8]:
len(cname)

8

In [9]:
df[cname[0]]

0      2003-12-31 00:00:00.0000000
1      1980-12-31 00:00:00.0000000
2      2001-02-08 00:00:00.0000000
3      2000-01-01 00:00:00.0000000
4      2002-06-01 00:00:00.0000000
                  ...
509    2012-10-17 00:00:00.0000000
510    2007-04-09 00:00:00.0000000
511    2005-06-01 00:00:00.0000000
512    2004-10-11 00:00:00.0000000
513    1995-05-10 00:00:00.0000000
Name: TANGGAL_PEROLEHAN, Length: 514, dtype: object

In [10]:
df = convert_todate(df, column_name=cname[0])
df[cname[0]]

0      2003-12-31
1      1980-12-31
2      2001-02-08
3      2000-01-01
4      2002-06-01
          ...
509    2012-10-17
510    2007-04-09
511    2005-06-01
512    2004-10-11
513    1995-05-10
Name: TANGGAL_PEROLEHAN, Length: 514, dtype: object

In [11]:
df[cname[1]]

0      2018-08-15 00:00:00.0000000
1      2018-03-15 00:00:00.0000000
2      2018-03-12 00:00:00.0000000
3      2018-08-01 00:00:00.0000000
4      2018-04-26 00:00:00.0000000
                  ...
509    2017-11-10 00:00:00.0000000
510    2018-03-12 00:00:00.0000000
511    2018-04-26 00:00:00.0000000
512    2017-11-27 00:00:00.0000000
513    2018-03-12 00:00:00.0000000
Name: TGL_BUKU, Length: 514, dtype: object

In [12]:
df = convert_todate(df, column_name=cname[1])
df[cname[1]]

0      2018-08-15
1      2018-03-15
2      2018-03-12
3      2018-08-01
4      2018-04-26
          ...
509    2017-11-10
510    2018-03-12
511    2018-04-26
512    2017-11-27
513    2018-03-12
Name: TGL_BUKU, Length: 514, dtype: object

In [13]:
df[cname[2]]

0      2018-08-15 00:00:00.0000000
1      2018-03-15 00:00:00.0000000
2      2018-03-12 00:00:00.0000000
3      2018-08-01 00:00:00.0000000
4      2018-04-26 00:00:00.0000000
                  ...
509    2017-11-10 00:00:00.0000000
510    2018-03-12 00:00:00.0000000
511    2018-04-26 00:00:00.0000000
512    2017-11-27 00:00:00.0000000
513    2018-03-12 00:00:00.0000000
Name: TGL_REKAM, Length: 514, dtype: object

In [14]:
df = convert_todate(df, column_name=cname[2])
df[cname[2]]

0      2018-08-15
1      2018-03-15
2      2018-03-12
3      2018-08-01
4      2018-04-26
          ...
509    2017-11-10
510    2018-03-12
511    2018-04-26
512    2017-11-27
513    2018-03-12
Name: TGL_REKAM, Length: 514, dtype: object

In [15]:
df[cname[3]]

0      2007-01-01 00:00:00.0000000
1      2009-09-15 00:00:00.0000000
2      2009-11-10 00:00:00.0000000
3      2008-12-10 00:00:00.0000000
4      2008-01-31 00:00:00.0000000
                  ...
509    2012-11-13 00:00:00.0000000
510    2009-11-10 00:00:00.0000000
511    2008-01-31 00:00:00.0000000
512    2008-12-31 00:00:00.0000000
513    2009-11-10 00:00:00.0000000
Name: TGL_REKAM_PERTAMA, Length: 514, dtype: object

In [16]:
df = convert_todate(df, column_name=cname[3])
df[cname[3]]

0      2007-01-01
1      2009-09-15
2      2009-11-10
3      2008-12-10
4      2008-01-31
          ...
509    2012-11-13
510    2009-11-10
511    2008-01-31
512    2008-12-31
513    2009-11-10
Name: TGL_REKAM_PERTAMA, Length: 514, dtype: object

In [17]:
df[cname[4]]

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
509   NaN
510   NaN
511   NaN
512   NaN
513   NaN
Name: TGL_DANA, Length: 514, dtype: float64

In [18]:
df = convert_todate(df, column_name=cname[4])
df[cname[4]]

0      0000-00-00
1      0000-00-00
2      0000-00-00
3      0000-00-00
4      0000-00-00
          ...
509    0000-00-00
510    0000-00-00
511    0000-00-00
512    0000-00-00
513    0000-00-00
Name: TGL_DANA, Length: 514, dtype: object

In [19]:
df[cname[5]]

0      2003-12-31 00:00:00.0000000
1      1980-12-31 00:00:00.0000000
2      2001-02-08 00:00:00.0000000
3      2000-01-01 00:00:00.0000000
4      2002-06-01 00:00:00.0000000
                  ...
509    2012-10-17 00:00:00.0000000
510    2007-04-09 00:00:00.0000000
511    2005-06-01 00:00:00.0000000
512    2004-10-11 00:00:00.0000000
513    1995-05-10 00:00:00.0000000
Name: TGL_PERLH, Length: 514, dtype: object

In [20]:
df = convert_todate(df, column_name=cname[5])
df[cname[5]]

0      2003-12-31
1      1980-12-31
2      2001-02-08
3      2000-01-01
4      2002-06-01
          ...
509    2012-10-17
510    2007-04-09
511    2005-06-01
512    2004-10-11
513    1995-05-10
Name: TGL_PERLH, Length: 514, dtype: object

In [21]:
df[cname[6]]

0                              NaN
1                              NaN
2                              NaN
3                              NaN
4                              NaN
                  ...
509    2019-09-24 00:00:00.0000000
510                            NaN
511                            NaN
512                            NaN
513                            NaN
Name: TGL_PSP, Length: 514, dtype: object

In [22]:
df = convert_todate(df, column_name=cname[6])
df[cname[6]]

0      0000-00-00
1      0000-00-00
2      0000-00-00
3      0000-00-00
4      0000-00-00
          ...
509    2019-09-24
510    0000-00-00
511    0000-00-00
512    0000-00-00
513    0000-00-00
Name: TGL_PSP, Length: 514, dtype: object

In [23]:
df[cname[7]]

0      20200226
1      20200226
2      20200226
3      20200226
4      20200226
         ...
509    20200226
510    20200226
511    20200226
512    20200226
513    20200226
Name: TGL_TARIK, Length: 514, dtype: int64

In [24]:
# declaration df to data variable
data = df
# declaration data series ('TGL_TARIK') to column_name
column_name = 'TGL_TARIK'

len_data = len(df)
# len_data = 10
data_series = []
for idx in range(len_data):
    len_data = len(df[column_name])
    data = df[column_name].iloc[idx]
    data = str(data)
    
    year = data[0:4]
    month = data[4:6]
    day = data[6:8]
    str_date = f'{year}-{month}-{day}'
#     print(str_date)

    try:
        at = arrow.get(str_date)
        date = at.date()
    except:
        str_date = f'0000-00-00'
#         at = arrow.get(str_date)
#         date = at.date()
        date = str_date
#         print(date)
#     print(date)

    data_series.append(date)

df[column_name] = data_series
df[column_name]
# return df

0      2020-02-26
1      2020-02-26
2      2020-02-26
3      2020-02-26
4      2020-02-26
          ...
509    2020-02-26
510    2020-02-26
511    2020-02-26
512    2020-02-26
513    2020-02-26
Name: TGL_TARIK, Length: 514, dtype: object

In [25]:
from sqlalchemy import create_engine

engine = create_engine('mysql://root:191618@localhost/db_logpolri')

In [26]:
df.to_sql('t_ASET_JALAN_JEMBATAN', con=engine, if_exists='append', chunksize=500, index=False)